---
kind: property
id: P:Autodesk.Revit.DB.Viewport.LabelOffset
source: html/d2856541-4f08-f212-99b3-0eee98bdb43c.htm
---
# Autodesk.Revit.DB.Viewport.LabelOffset Property

The offset is a two-dimensional vector from left bottom corner of the viewport with Rotation set to None to the left end of the viewport label line. The Z coordinate is ignored.

## Syntax (C#)
```csharp
public XYZ LabelOffset { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null